newwms_gift/src/Documents/итWMSЗадачиИнвентаризации/итWMSЗадачиИнвентаризации.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>итWMSЗадачиИнвентаризации</name>
  <attributes>
    <name>СтатусДокумента</name>
    <type>
      <types>EnumRef.итWMSСтатусыСкладскихДокументов</types>
    </type>
  </attributes>
  <attributes>
    <name>итОснование</name>
    <type>
      <types>DocumentRef.ЗаказПокупателя</types>
      <types>DocumentRef.итWMSКонтрольнаяОперацияАгрегации</types>
      <types>DocumentRef.ПеремещениеТоваров</types>
      <types>DocumentRef.итWMSСписаниеТовара</types>
      <types>DocumentRef.итWMSИзменениеПараметровТовараВЯчейках</types>
      <types>DocumentRef.итWMSНаборка</types>
      <types>DocumentRef.итWMSДокументСвободнойАгрегации</types>
      <types>DocumentRef.итWMSПеремещение</types>
      <types>DocumentRef.итWMSОтгрузка</types>
      <types>DocumentRef.итWMSПриемка</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>НеРаспределятьНаТСД</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаЗавершенияДокумента</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>БлокироватьЯчейкиНаВремяИсполнения</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ЗаданияПоЯчейкам</name>
    <attributes>
      <name>ИдЗадачи</name>
      <type>
        <types>UUID</types>
      </type>
    </attributes>
    <attributes>
      <name>Ячейка</name>
      <type>
        <types>CatalogRef.итСкладскиеЯчейки</types>
      </type>
    </attributes>
    <attributes>
      <name>СостояниеЗадачи</name>
      <type>
        <types>EnumRef.итWMSСостоянияЗадачТСД</types>
      </type>
    </attributes>
    <attributes>
      <name>Блокирована</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

newwms_gift/src/InformationRegisters/итWMSЗадачиТСД/итWMSЗадачиТСД.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>итWMSЗадачиТСД</name>
  <resources>
    <name>ИдентификаторУпаковки</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>172</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>ЯчейкаОтправитель</name>
    <type>
      <types>CatalogRef.итСкладскиеЯчейки</types>
    </type>
  </resources>
  <resources>
    <name>ЯчейкаПолучатель</name>
    <type>
      <types>CatalogRef.итСкладскиеЯчейки</types>
    </type>
  </resources>
  <resources>
    <name>ДополнительныеДанные</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </resources>
  <attributes>
    <name>ДатаНачала</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаОкончания</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>Состояние</name>
    <type>
      <types>EnumRef.итWMSСостоянияЗадачТСД</types>
    </type>
  </attributes>
  <attributes>
    <name>ФиксацияЗадачи</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ДанныеДокументаТСД</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <dimensions>
    <name>ТСД</name>
    <type>
      <types>CatalogRef.итWMSСправочникТСД</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ДокументОснование</name>
    <type>
      <types>DocumentRef.итWMSКонтрольнаяОперацияАгрегации</types>
      <types>DocumentRef.итWMSРазмещение</types>
      <types>DocumentRef.итWMSЗадачиИнвентаризации</types>
      <types>DocumentRef.итWMSПроверка</types>
      <types>DocumentRef.итWMSНаборка</types>
      <types>DocumentRef.итWMSПеремещение</types>
      <types>DocumentRef.итWMSОтгрузка</types>
      <types>DocumentRef.итWMSПриемка</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ТипЗадачи</name>
    <type>
      <types>EnumRef.итWMSТипыЗадачТСД</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ИдЗадачи</name>
    <type>
      <types>UUID</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ИдЗадачиРодителя</name>
    <type>
      <types>UUID</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

newwms_gift/src/Enums/итWMSСтатусыСкладскихДокументов/итWMSСтатусыСкладскихДокументов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>итWMSСтатусыСкладскихДокументов</name>
  <enumValues>
    <name>Создан</name>
  </enumValues>
  <enumValues>
    <name>Зарезервирован</name>
  </enumValues>
  <enumValues>
    <name>Распределяется</name>
  </enumValues>
  <enumValues>
    <name>Распределен</name>
  </enumValues>
  <enumValues>
    <name>Выполнен</name>
  </enumValues>
  <enumValues>
    <name>ВыполненСОшибкой</name>
  </enumValues>
  <enumValues>
    <name>Завершен</name>
  </enumValues>
</mdclass:Enum>

newwms_gift/src/Enums/итWMSСостоянияЗадачТСД/итWMSСостоянияЗадачТСД.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>итWMSСостоянияЗадачТСД</name>
  <enumValues>
    <name>КВыполнению</name>
  </enumValues>
  <enumValues>
    <name>ОжидаетРазрешения</name>
  </enumValues>
  <enumValues>
    <name>Отменена</name>
  </enumValues>
  <enumValues>
    <name>Выполнена</name>
  </enumValues>
  <enumValues>
    <name>Выполняется</name>
  </enumValues>
</mdclass:Enum>

newwms_gift/src/Documents/итWMSДанныеИнвентаризации/итWMSДанныеИнвентаризации.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>итWMSДанныеИнвентаризации</name>
  <registerRecords>AccumulationRegister.итТоварыВЯчейках</registerRecords>
  <attributes>
    <name>СтатусДокумента</name>
    <type>
      <types>EnumRef.итWMSСтатусыСкладскихДокументов</types>
    </type>
  </attributes>
  <attributes>
    <name>итОснование</name>
    <type>
      <types>DocumentRef.ЗаказПокупателя</types>
      <types>DocumentRef.ПеремещениеТоваров</types>
      <types>DocumentRef.итWMSЗадачиИнвентаризации</types>
      <types>DocumentRef.итWMSПриемка</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Товары</name>
    <attributes>
      <name>ДатаИнвентаризации</name>
      <type>
        <types>Date</types>
      </type>
    </attributes>
    <attributes>
      <name>Ячейка</name>
      <type>
        <types>CatalogRef.итСкладскиеЯчейки</types>
      </type>
    </attributes>
    <attributes>
      <name>ИдентификаторУпаковки</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>172</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>ДатаРозлива</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КоличествоПлан</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КоличествоФакт</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СерияНоменклатуры</name>
      <type>
        <types>CatalogRef.СерииНоменклатуры</types>
      </type>
    </attributes>
    <attributes>
      <name>Склад</name>
      <type>
        <types>CatalogRef.Склады</types>
      </type>
    </attributes>
    <attributes>
      <name>Качество</name>
      <type>
        <types>CatalogRef.Качество</types>
      </type>
    </attributes>
    <attributes>
      <name>Организация</name>
      <type>
        <types>CatalogRef.Организации</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

newwms_gift/src/Catalogs/итСкладскиеЯчейки/итСкладскиеЯчейки.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>итСкладскиеЯчейки</name>
  <comment>Используется при адресном хранении на складском помещении.</comment>
  <hierarchical>true</hierarchical>
  <predefined>
    <items>
      <name>ПустаяЯчейка</name>
      <description>Пустая ячейка</description>
    </items>
  </predefined>
  <attributes>
    <name>СкладскоеПомещение</name>
    <type>
      <types>CatalogRef.итСкладскиеПомещения</types>
    </type>
  </attributes>
  <attributes>
    <name>Линия</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>3</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Секция</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>3</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Стеллаж</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>5</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Ярус</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>3</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Позиция</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>2</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПорядокОбхода</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>7</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Типоразмер</name>
    <type>
      <types>CatalogRef.итТипоразмерыЯчеек</types>
    </type>
  </attributes>
  <attributes>
    <name>УровеньДоступности</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>2</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>МаксимальныйКоэффициентНаполненностиПоВесу</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>МаксимальныйКоэффициентНаполненностиПоОбъему</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Заблокирована</name>
    <comment>Используется для временной блокировки ячеек. Заблок.яч. перестает попадать в автоматическую и ручную раздачу</comment>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>КоличествоПалет</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>7</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Зона</name>
    <type>
      <types>EnumRef.итWMSЗоныСклада</types>
    </type>
  </attributes>
  <attributes>
    <name>НомерРяда_Пролета</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ЯчейкаНачалаРазмещения</name>
    <type>
      <types>CatalogRef.итСкладскиеЯчейки</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаСнятияБлокировкиИнвентаризации</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидСкладскойДеятельности</name>
    <type>
      <types>EnumRef.ит_WMS_ВидыСкладскойДеятельности</types>
    </type>
  </attributes>
</mdclass:Catalog>

newwms_gift/src/Documents/итWMSЗадачиИнвентаризации/Forms/ФормаДокумента/Module.bsl
#Область ОбработчикиСобытий
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Если Параметры.Ключ.Пустая() тогда
		Объект.итОснование=Неопределено;
		Объект.СтатусДокумента=Перечисления.итWMSСтатусыСкладскихДокументов.Создан;
		Объект.Ответственный=ПараметрыСеанса.ТекущийПользователь;
		для Каждого стр из Объект.ЗаданияПоЯчейкам цикл
			стр.ИдЗадачи=новый УникальныйИдентификатор;
		КонецЦикла;
	КонецЕсли;
	ВидимостьДоступностьЭлементовСервер();
КонецПроцедуры
&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
	ВидимостьДоступностьЭлементовСервер();
	ПроставитьЯрус();
КонецПроцедуры

&НаКлиенте
Процедура ЗаданияПоЯчейкамЯчейкаПриИзменении(Элемент)
	ТекущаяЯчейка=ТекущийЭлемент.ТекущиеДанные.Ячейка;
	МассивСтрок=Объект.ЗаданияПоЯчейкам.НайтиСтроки(новый Структура("Ячейка",ТекущаяЯчейка));
	Если МассивСтрок.Количество()>1 тогда
		Сообщить("В документе уже присутствует текущая ячейка");
		ЗаданияПоЯчейкамЯчейкаПриИзмененииСервер(ТекущийЭлемент.ТекущиеДанные.ПолучитьИдентификатор());
	КонецЕсли;
	ПроставитьЯрус(ТекущийЭлемент.ТекущиеДанные.ПолучитьИдентификатор());
	
КонецПроцедуры
&НаСервере
Процедура ЗаданияПоЯчейкамЯчейкаПриИзмененииСервер(Идентификатор)
	Строка=Объект.ЗаданияПоЯчейкам.НайтиПоИдентификатору(Идентификатор);
	Строка.Ячейка=Справочники.итСкладскиеЯчейки.ПустаяСсылка();
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаВыбора(ВыбранноеЗначение, ИсточникВыбора)
		Если ИсточникВыбора.ИмяФормы="Документ.итWMSЗадачиИнвентаризации.Форма.ФормаВыбораЕНБ"  тогда
			Если ТипЗнч(ВыбранноеЗначение)=Тип("Структура") Тогда
				ЗаполнитьЯчейкамиДокумент(ВыбранноеЗначение)
				
			КонецЕсли;
		КонецЕсли;
		Если ИсточникВыбора.ИмяФормы="Документ.итWMSЗадачиИнвентаризации.Форма.ФормаПодбораЯчеекПоНоменклатуре"  тогда
			Если ТипЗнч(ВыбранноеЗначение)=Тип("Массив") Тогда
				ЗаполнитьДокументЯчейкамиИзМассива(ВыбранноеЗначение)				
			КонецЕсли;
		КонецЕсли;
КонецПроцедуры
&НаКлиенте
Процедура ПриОткрытии(Отказ)
	Если Объект.ЗаданияПоЯчейкам.Количество()>0 Тогда 
		ПроставитьЯрус();
	КонецЕсли;
КонецПроцедуры
&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
		Если Источник.ИмяФормы="Документ.итWMSДанныеИнвентаризации.Форма.ФормаДокумента"  тогда
			Если ИмяСобытия="ДокументЗаписанитWMSЗадачиИнвентаризации" Тогда 
				ВидимостьДоступностьЭлементовКлиент();
			КонецЕсли;
		КонецЕсли;
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКоманд
&НаКлиенте
Процедура Добавить(Команда)
	Объект.ЗаданияПоЯчейкам.Добавить().ИдЗадачи=новый УникальныйИдентификатор;
КонецПроцедуры
&НаКлиенте
Процедура ЗаполнитьЯчейки(Команда)
	ОткрытьФорму("Документ.итWMSЗадачиИнвентаризации.Форма.ФормаВыбораЕНБ",,ЭтаФорма);
КонецПроцедуры

&НаКлиенте
Процедура Скопировать(Команда)
	Если ТекущийЭлемент.Имя="ЗаданияПоЯчейкам" тогда
		НоваяСтрока=Объект.ЗаданияПоЯчейкам.Добавить() ;
		ЗаполнитьЗначенияСвойств(НоваяСтрока,ТекущийЭлемент.ТекущиеДанные);
		НоваяСтрока.ИдЗадачи=новый УникальныйИдентификатор;
	КонецЕсли;		
КонецПроцедуры
&НаКлиенте
Процедура СортироватьПоЯрусу(Команда)
	Объект.ЗаданияПоЯчейкам.Сортировать("Ярус Возр,Ячейка Возр");	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьОтборомПоОстаткам(Команда)
	ОткрытьФорму("Документ.итWMSЗадачиИнвентаризации.Форма.ФормаПодбораЯчеекПоНоменклатуре",,ЭтаФорма);
КонецПроцедуры

&НаКлиенте
Процедура СоздатьДокументДанныеИнвентаризации(Команда)
	ОткрытьФорму("Документ.итWMSДанныеИнвентаризации.Форма.ФормаДокумента",новый Структура("итОснование",Объект.Ссылка),ЭтаФорма);
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции
&НаКлиенте
Процедура ВидимостьДоступностьЭлементовКлиент()
	ВидимостьДоступностьЭлементовСервер();
КонецПроцедуры
&НаСервере
Процедура ВидимостьДоступностьЭлементовСервер()
	Если Объект.СтатусДокумента=Перечисления.итWMSСтатусыСкладскихДокументов.Распределен или
		Объект.СтатусДокумента=Перечисления.итWMSСтатусыСкладскихДокументов.Распределяется Тогда 
		Элементы.НеРаспределятьНаТСД.ТолькоПросмотр=Истина;
		Элементы.БлокироватьЯчейкиНаВремяИсполнения.ТолькоПросмотр=Истина;
		Элементы.ЗаданияПоЯчейкам.ТолькоПросмотр=Истина;
		Элементы.ЗаданияПоЯчейкамГруппаЗаполнить.Видимость=Ложь;
		Элементы.ФормаСоздатьДокументДанныеИнвентаризации.Видимость=Ложь;
	КонецЕсли;
	Если Объект.СтатусДокумента=Перечисления.итWMSСтатусыСкладскихДокументов.Создан или
		Объект.СтатусДокумента=Перечисления.итWMSСтатусыСкладскихДокументов.Зарезервирован тогда
		Элементы.НеРаспределятьНаТСД.ТолькоПросмотр=Ложь;
		Элементы.БлокироватьЯчейкиНаВремяИсполнения.ТолькоПросмотр=Ложь;
		Элементы.ЗаданияПоЯчейкам.ТолькоПросмотр=Ложь;
		Элементы.ЗаданияПоЯчейкамГруппаЗаполнить.Видимость=Истина;
		Элементы.ФормаСоздатьДокументДанныеИнвентаризации.Видимость=Ложь;
	КонецЕсли;
	Если Объект.СтатусДокумента=Перечисления.итWMSСтатусыСкладскихДокументов.Выполнен или
		Объект.СтатусДокумента=Перечисления.итWMSСтатусыСкладскихДокументов.ВыполненСОшибкой
		или  Объект.СтатусДокумента=Перечисления.итWMSСтатусыСкладскихДокументов.Завершен
		тогда
		Элементы.НеРаспределятьНаТСД.ТолькоПросмотр=Ложь;
		Элементы.БлокироватьЯчейкиНаВремяИсполнения.ТолькоПросмотр=Ложь;
		Элементы.ЗаданияПоЯчейкам.ТолькоПросмотр=Ложь;
		Элементы.ЗаданияПоЯчейкамГруппаЗаполнить.Видимость=Ложь;
		Элементы.ФормаСоздатьДокументДанныеИнвентаризации.Видимость= не ДокументДанныеИнвентаризацииУжеСоздан();
	КонецЕсли;
	
	
КонецПроцедуры
&НаСервере
Функция ДокументДанныеИнвентаризацииУжеСоздан()
	//{{КОНСТРУКТОР_ЗАПРОСА_С_ОБРАБОТКОЙ_РЕЗУЛЬТАТА
	// Данный фрагмент построен конструктором.
	// При повторном использовании конструктора, внесенные вручную изменения будут утеряны!!!
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	итWMSДанныеИнвентаризации.Ссылка
		|ИЗ
		|	Документ.итWMSДанныеИнвентаризации КАК итWMSДанныеИнвентаризации
		|ГДЕ
		|	итWMSДанныеИнвентаризации.ПометкаУдаления = ЛОЖЬ
		|	И итWMSДанныеИнвентаризации.итОснование = &Ссылка";
	
	Запрос.УстановитьПараметр("Ссылка", Объект.Ссылка);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Если  ВыборкаДетальныеЗаписи.Следующий() Тогда 
		//Сообщить("У задачи уже имеется не помеченный на удаление документ <<ДанныеИнвентаризации>>");
		Возврат Истина;
	КонецЕсли;
	    Возврат Ложь;
	//}}КОНСТРУКТОР_ЗАПРОСА_С_ОБРАБОТКОЙ_РЕЗУЛЬТАТА
	
КонецФункции
&НаСервере
Процедура ЗаполнитьЯчейкамиДокумент(СтруктураЗначенияВыбора)
	//{{КОНСТРУКТОР_ЗАПРОСА_С_ОБРАБОТКОЙ_РЕЗУЛЬТАТА
	// Данный фрагмент построен конструктором.
	// При повторном использовании конструктора, внесенные вручную изменения будут утеряны!!!
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	итWMSЗадачиТСД.ЯчейкаОтправитель,
	|	итWMSЗадачиТСД.Состояние
	|ПОМЕСТИТЬ ОтмененныеЯчейкиЗаПериод
	|ИЗ
	|	РегистрСведений.итWMSЗадачиТСД КАК итWMSЗадачиТСД
	|ГДЕ
	|	ВЫБОР
	|			КОГДА &ОтобратьТолькоНеВыполненныеЗаПериод
	|				ТОГДА итWMSЗадачиТСД.ДокументОснование.Дата МЕЖДУ &ДатаНачала И &ДатаОкончания
	|						И итWMSЗадачиТСД.ТипЗадачи = ЗНАЧЕНИЕ(Перечисление.итWmsТипыЗадачТСД.Инвентаризация)
	|			ИНАЧЕ ЛОЖЬ
	|		КОНЕЦ
	|	И итWMSЗадачиТСД.ДокументОснование.Проведен = ИСТИНА
	|
	|СГРУППИРОВАТЬ ПО
	|	итWMSЗадачиТСД.ЯчейкаОтправитель,
	|	итWMSЗадачиТСД.Состояние
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ОтмененныеЯчейкиЗаПериод.ЯчейкаОтправитель,
	|	МАКСИМУМ(ВЫБОР
	|			КОГДА ОтмененныеЯчейкиЗаПериод.Состояние = ЗНАЧЕНИЕ(Перечисление.итWMSСостоянияЗадачТСД.Отменена)
	|				ТОГДА 0
	|			ИНАЧЕ 1
	|		КОНЕЦ) КАК Состояние
	|ПОМЕСТИТЬ ГруппировкаДанныхЯчеек
	|ИЗ
	|	ОтмененныеЯчейкиЗаПериод КАК ОтмененныеЯчейкиЗаПериод
	|
	|СГРУППИРОВАТЬ ПО
	|	ОтмененныеЯчейкиЗаПериод.ЯчейкаОтправитель
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ГруппировкаДанныхЯчеек.ЯчейкаОтправитель
	|ПОМЕСТИТЬ ТолькоОтмененные
	|ИЗ
	|	ГруппировкаДанныхЯчеек КАК ГруппировкаДанныхЯчеек
	|ГДЕ
	|	ГруппировкаДанныхЯчеек.Состояние = 0
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	итСкладскиеЯчейки.Ссылка
	|ИЗ
	|	Справочник.итСкладскиеЯчейки КАК итСкладскиеЯчейки
	|ГДЕ
	|	ВЫБОР
	|			КОГДА &ЗаполнятьПоЯрусам
	|				ТОГДА итСкладскиеЯчейки.Ярус = &ЯрусЗаполнения
	|			ИНАЧЕ ИСТИНА
	|		КОНЕЦ
	|	И итСкладскиеЯчейки.Ссылка В ИЕРАРХИИ(&Ссылка)
	|	И ВЫБОР
	|			КОГДА &ИгнорироватьЗаблокированные
	|				ТОГДА НЕ итСкладскиеЯчейки.Заблокирована
	|			ИНАЧЕ ИСТИНА
	|		КОНЕЦ
	|	И НЕ итСкладскиеЯчейки.Ссылка В (&МассивЯчеек)
	|	И итСкладскиеЯчейки.ЭтоГруппа = ЛОЖЬ
	|	И итСкладскиеЯчейки.ПометкаУдаления = ЛОЖЬ
	|	И ВЫБОР
	|			КОГДА &ОтобратьТолькоНеВыполненныеЗаПериод
	|				ТОГДА итСкладскиеЯчейки.Ссылка В
	|						(ВЫБРАТЬ
	|							ТолькоОтмененные.ЯчейкаОтправитель
	|						ИЗ
	|							ТолькоОтмененные КАК ТолькоОтмененные)
	|			ИНАЧЕ ИСТИНА
	|		КОНЕЦ
	|
	|УПОРЯДОЧИТЬ ПО
	|	итСкладскиеЯчейки.Ярус";
	
	Запрос.УстановитьПараметр("ЗаполнятьПоЯрусам", СтруктураЗначенияВыбора.ЗаполнятьПоЯрусам);
	Запрос.УстановитьПараметр("ИгнорироватьЗаблокированные", СтруктураЗначенияВыбора.ИгнорироватьЗаблокированные);
	Запрос.УстановитьПараметр("Ссылка", СтруктураЗначенияВыбора.Ссылка);
	Запрос.УстановитьПараметр("ЯрусЗаполнения", СтруктураЗначенияВыбора.ЯрусЗаполнения);
	Запрос.УстановитьПараметр("МассивЯчеек",Объект.ЗаданияПоЯчейкам.Выгрузить().ВыгрузитьКолонку("Ячейка"));
	Запрос.УстановитьПараметр("ОтобратьТолькоНеВыполненныеЗаПериод",СтруктураЗначенияВыбора.ОтобратьТолькоНеВыполненныеЗаПериод);
	Запрос.УстановитьПараметр("ДатаНачала",СтруктураЗначенияВыбора.ДатаНачала);
	Запрос.УстановитьПараметр("ДатаОкончания",СтруктураЗначенияВыбора.ДатаОкончания);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	//Объект.ЗаданияПоЯчейкам.Очистить();
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		НоваяСтрока=Объект.ЗаданияПоЯчейкам.Добавить();
		НоваяСтрока.ИдЗадачи=новый УникальныйИдентификатор;
		НоваяСтрока.Ячейка=ВыборкаДетальныеЗаписи.Ссылка;
		ПроставитьЯрус(НоваяСтрока)
	КонецЦикла;
	Объект.ЗаданияПоЯчейкам.Сортировать("Ярус Возр,Ячейка Возр");
	//}}КОНСТРУКТОР_ЗАПРОСА_С_ОБРАБОТКОЙ_РЕЗУЛЬТАТА
	
	
КонецПроцедуры
&НаСервере
Процедура ПроставитьЯрус(Строка=Неопределено)
	Если ТипЗнч(Строка)=Тип("Число") тогда
		СтрокаИзменения=Объект.ЗаданияПоЯчейкам.НайтиПоИдентификатору(Строка);
		СтрокаИзменения.Ярус=Число(СтрокаИзменения.Ячейка.Ярус);
		Возврат
	КонецЕсли;	
	
	//@skip-warning
	Если Строка=Неопределено Тогда 
		для Каждого стр из Объект.ЗаданияПоЯчейкам цикл
			стр.Ярус= Число(стр.Ячейка.Ярус);
		КонецЦикла;
	иначе
		Строка.Ярус=Число(Строка.Ячейка.Ярус);
	КонецЕсли;	
КонецПроцедуры
&НаСервере
Процедура ЗаполнитьДокументЯчейкамиИзМассива(МассивЯчеек)
	//{{КОНСТРУКТОР_ЗАПРОСА_С_ОБРАБОТКОЙ_РЕЗУЛЬТАТА
	// Данный фрагмент построен конструктором.
	// При повторном использовании конструктора, внесенные вручную изменения будут утеряны!!!
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	итСкладскиеЯчейки.Ссылка КАК Ячейка
		|ПОМЕСТИТЬ ЯчейкиОтбора
		|ИЗ
		|	Справочник.итСкладскиеЯчейки КАК итСкладскиеЯчейки
		|ГДЕ
		|	итСкладскиеЯчейки.Ссылка В(&МассивЯчеек)
		|
		|СГРУППИРОВАТЬ ПО
		|	итСкладскиеЯчейки.Ссылка
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ЯчейкиОтбора.Ячейка
		|ИЗ
		|	ЯчейкиОтбора КАК ЯчейкиОтбора
		|ГДЕ
		|	НЕ ЯчейкиОтбора.Ячейка В (&МассивЯчеекДокумента)";
	
	Запрос.УстановитьПараметр("МассивЯчеек", МассивЯчеек);
	Запрос.УстановитьПараметр("МассивЯчеекДокумента", Объект.ЗаданияПоЯчейкам.Выгрузить().ВыгрузитьКолонку("Ячейка"));
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
	    НоваяСтрока=Объект.ЗаданияПоЯчейкам.Добавить();
		НоваяСтрока.ИдЗадачи=новый УникальныйИдентификатор;
		НоваяСтрока.Ячейка=ВыборкаДетальныеЗаписи.Ячейка;
		ПроставитьЯрус(НоваяСтрока)
	КонецЦикла;
	Объект.ЗаданияПоЯчейкам.Сортировать("Ярус Возр,Ячейка Возр");
	
	
	
КонецПроцедуры




#КонецОбласти
